[
  {
    "key": "11646-cedar-spring-court",
    "address": "11646 Cedar Spring Court",
    "price": "3,850,000",
    "fullAddress": "11646 Cedar Spring Court, Cupertino, CA 95014",
    "numBeds": "4",
    "numBaths": "3",
    "sqft": "2334",
    "propertyImage": "/11646-cedar-spring-court.jpg",
    "description": "Explore the enchanting community of Seven Springs with Award-Winning Monta Vista High, where this exquisite 4bd/3ba home is nestled. Enjoy the perks of two tennis courts, large swimming pools, and clubhouses for festive gatherings. The 2,334 Sqft home was renovated in 2016. It has a chef's dream kitchen with Bosch stainless steel appliances, Brazilian hardwood floors, and a stunning spacious living room with 16' high ceilings. The main floor includes a versatile bedroom with a full bathroom, perfect for guests or an office. Upstairs, the spacious primary suite offers vaulted ceilings, a huge walk-in closet, and a luxurious en suite bathroom. Conveniently located near major tech hubs and freeways. This home is in a sought-after neighborhood, perfect for entertaining, wonderful floor plan, and combines elegance with accessibility."
  },
  {
    "key": "1888-farndon-avenue",
    "address": "1888 Farndon Avenue",
    "price": "3,458,000",
    "fullAddress": "1888 Farndon Avenue, Los Altos, CA 94024",
    "numBeds": "3",
    "numBaths": "2.5",
    "sqft": "1978",
    "propertyImage": "/1888-farndon-avenue.jpg",
    "description": "This beautifully maintained home has been owned and lovingly cared for by the same family for over 48 years. This large lot provides a serene and private retreat in Los Altos. Enter the foyer and move to the inviting living space with fireplace, separate dining room and inside laundry area, ensuring comfort and convenience for your family's needs. The well-appointed kitchen is equipped with modern amenities, perfect for culinary enthusiasts. The spacious and elegant master bedroom suite boasts a walk in closet and large master bathroom. The mature landscaping adds to the property's appeal, creating a tranquil ambiance. With close proximity to great schools, parks, shopping, dining and the Silicon Valley Tech Companies, this home is a prime choice for all home buyers alike. Don't miss the opportunity to own this prime property. Updated with new flooring, new hardware, new light fixtures, and freshly painted inside, the home is ready for new owners."
  },
  {
    "key": "1111-alderbrook-lane",
    "address": "1111 Alderbrook Lane",
    "price": "3,328,000",
    "fullAddress": "1111 Alderbrook Lane, San Jose, CA 95129",
    "numBeds": "4",
    "numBaths": "3",
    "sqft": "2121",
    "propertyImage": "/1111-alderbrook-lane.jpg",
    "description": "Single-Story Home Beautifully Extended & Renovated in 2019 with Modern Touches; Nestled in Sought-After Lynbrook High Neighborhood; Bright & Airy; 4 Bed + Den, 3 Bath; 2,121+/-SF; Two Suites; Engineered Hardwood Floor & Recessed Light Throughout; Open Living Room & Formal Dining; Spacious Great Room Combined Kitchen & Family Room with Side Door & Glass Sliding Door Access to Backyard; Luxurious Stylish Kitchen with Premium Decora Cabinetry, Big Island, Breakfast Bar, Plenty of Cabinets, Thermador 6-Burner Gas Range, Hood, Quartz Countertop, Backsplash & Pantry; Primary Suite with Walk-in Closet, Multiple Windows, Stall Shower, Jetted Tub, Toto Toilet & Washlet; Central A/C; Solar Panel; Tankless Water Heater; Attached 2-Car Garage with Tesla EV Charger, Storage Cabinets, Laundry & Water Softener; Convenient Location Near Cupertino Main Street, Apple Campus, Parks, Library, Supermarkets & Shopping; Easy Access to Highway 85/280, Lawrence Expwy & Jobs; Outstanding Cupertino Union Schools: Dilworth Elementary, Miller Middle & Lynbrook High"
  },
  {
    "key": "18188-edminton-drive",
    "address": "18188 Edminton Drive",
    "price": "3,100,888",
    "fullAddress": "18188 Edminton Drive, Cupertino, CA 95014",
    "numBeds": "4",
    "numBaths": "3",
    "sqft": "2741",
    "propertyImage": "/18188-edminton-drive.jpg",
    "description": "Discover an exceptional home in one of the communitys prime locations. This sun-drenched gem, built in 1990, offers 2,741 sqft of living space on a 5,394 sqft lot, featuring 4 bedrooms and 3 full baths. The inviting layout includes a cozy living room with a fireplace, a formal dining area with a wet bar, and a gourmet kitchen with granite countertops and a central island, a gas range, double ovens, and a double-door refrigerator. The primary bedroom boasts a walk-in closet, vaulted ceilings, and a fireplace, while the en-suite bathroom features a jacuzzi tub, glass shower, and new double sinks. Upstairs, two bedrooms share a stylish bathroom with double sinks and a bathtub, plus views of the backyard. The downstairs bedroom can serve as an office or guest room, with a nearby bath for convenience. The laundry room includes hookups, a sink, and a laundry chute. Enjoy the family rooms second fireplace and a small dining area that opens to a charming wood deck. Fresh wood chips and gravel enhance the exterior. Located in the top-rated Cupertino School District with easy access to Lawrence Expressway, parks, shopping, and dining."
  },
  {
    "key": "381-pismo-terrace",
    "address": "381 Pismo Terrace",
    "price": "2,458,000",
    "fullAddress": "381 Pismo Terrace, Sunnyvale, CA 94086",
    "numBeds": "3",
    "numBaths": "2.5",
    "sqft": "1354",
    "propertyImage": "/381-pismo-terrace.jpg",
    "description": "Lovely 2-Story Home Nestled in Sought-After Somerset Community in Sunnyvale; Built by SummerHill Homes; 3 Bed, 2.5 Bath; 1,354+/-SF; Bright, Light & Airy; Fresh Exterior & Interior Paint; Inviting Open Living Area with Soaring Ceilings, High Windows, Hardwood Flooring & Gas Fireplace; Formal Dining with New Chandelier & French Doors Access to Patio; Gorgeous Kitchen with Modern Cabinetry, Quartz Countertops, Island, Breakfast Bar, Gas Range, Hood & Stainless Steel Appliances; Flowing to Cozy Family Room with Glass Sliding Doors Lead to Backyard; All Three Bedrooms on 2nd Floor with New Carpet Flooring Throughout; Primary Suite with Vaulted Ceilings, Walk-in Closet, Bathroom with Dual Sink, Granite Countertop & Stall Shower; Central A/C; Double Pane Windows; Attached 2-Car Garage with Laundry; Entertaining Paved Backyard; Blocks Away from Park, Library & Civic Center; Convenient Location Near Shopping, Public or Private Schools & Downtown Sunnyvale Featuring Restaurants, Theater, Farmers Market & Supermarket; Easy Access to Highway 85/237, El Camino Real, Caltrain Station & Jobs; Excellent Schools: Cumberland Elementary, Sunnyvale Middle & Homestead High"
  },
  {
    "key": "1105-starbird-circle",
    "address": "1105 Starbird Circle",
    "price": "1,660,000",
    "fullAddress": "1105 Starbird Circle, San Jose, CA 95117",
    "numBeds": "",
    "numBaths": "",
    "sqft": "2210",
    "propertyImage": "/1105-starbird-circle.jpg",
    "description": "This fantastic Duplex home is situated in the highly sought-after Central Silicon Valley, perfectly located between Santa Clara and Campbell. With over 2,200 SqFt of living space, this home boasts a stunning paver porch and courtyard. The 3-bed/2-bath unit has been recently renovated with exceptional attention to detail, featuring modern finishes that complement the kitchen. This Duplex not only offers comfort but also the convenience of urban living. The property is also a great high cash flow investment opportunity. Perfect for families who enjoy Starbird park amenities. This home is an ideal owner-occupied property in a prime location. FEATURE *Vaulted ceiling *Recessed lights *Engineered hardwood floor *Bamboo floors *Artificial Quartz Kitchen counter top, JennAir cook top, Microwave, Convection oven *Baths have Hi-Tech toilets *Washer/dryer inside *Tankless water heater *Copper pipes *Upgraded double paned windows/sliders *Corner location allows for plenty of parking."
  },
  {
    "key": "482-nottingham-way",
    "address": "482 Nottingham Way",
    "price": "1,660,000",
    "fullAddress": "482 Nottingham Way, Campbell, CA 95008",
    "numBeds": "",
    "numBaths": "",
    "sqft": "2443",
    "propertyImage": "/482-nottingham-way.jpg",
    "description": "This fantastic Duplex home is situated in the highly sought-after Central Silicon Valley, perfectly located between Santa Clara and Campbell. With over 2,200 SqFt of living space, this home boasts a stunning paver porch and courtyard. The 3-bed/2-bath unit has been recently renovated with exceptional attention to detail, featuring modern finishes that complement the kitchen. This Duplex not only offers comfort but also the convenience of urban living. The property is also a great high cash flow investment opportunity. Perfect for families who enjoy Starbird park amenities. This home is an ideal owner-occupied property in a prime location. FEATURE *Vaulted ceiling *Recessed lights *Engineered hardwood floor *Bamboo floors *Artificial Quartz Kitchen counter top, JennAir cook top, Microwave, Convection oven *Baths have Hi-Tech toilets *Washer/dryer inside *Tankless water heater *Copper pipes *Upgraded double paned windows/sliders *Corner location allows for plenty of parking."
  },
  {
    "key": "1515-fairway-green-circle",
    "address": "1515 Fairway Green Circle",
    "price": "1,300,000",
    "fullAddress": "1515 Fairway Green Circle, San Jose, CA 95131",
    "numBeds": "2",
    "numBaths": "2.5",
    "sqft": "1558",
    "propertyImage": "/1515-fairway-green-circle.jpg",
    "description": "Welcome to this rarely available stunning Townhouse near Townsend park and the Golf Course! The inviting living room boasts soaring high ceilings and a cozy wood burning fireplace. The kitchen has been updated with granite countertops, mosaic tile backsplash,stainless steel appliances and features a charming breakfast nook. Upstairs, the expansive primary suite features a vaulted ceiling and a private balcony. The second suite is equally spacious and includes a private bath. Additional features include a side-by-side two-car garage, an in-unit laundry room, newly replaced washer dryer and dishwasher. Entertain friends and family in the spacious backyard, which has been upgraded with a sprinkler system and features plenty of fruit trees, including lemon, loquat, avocado, and more. The Complex amenities include a pool, Spa, gym and Clubhouse. Walking distance to Municipal Golf Course, Townsend Park, and tennis courts. Close to private schools like Challenger and Stratford. Easy access to Highway 680/101/880, H-mart/Ranch 99/Costco/Safeway/Sprouts and many high tech companies."
  },
  {
    "key": "545-holthouse-terrace",
    "address": "545 Holthouse Terrace",
    "price": "1,250,000",
    "fullAddress": "545 Holthouse Terrace, Sunnyvale, CA 94087",
    "numBeds": "2",
    "numBaths": "3",
    "sqft": "1276",
    "propertyImage": "/545-holthouse-terrace.jpg",
    "description": "Location! Location! Location! This bright and roomy townhome is centrally located in the heart of Sunnyvale. Within 10 minute drive to Apple, Google and plenty of restaurants and grocery stores located on El Camino Real. This home offers gleaming hardwood floors, granite countertops, designer touches throughout, Central A/C & Heating along with recess lighting, stainless steel appliances & an oversized kitchen island for all of your culinary needs. Community offers BBQ/Picnic area & small park for some family fun."
  },
  {
    "key": "493-daisydell-court",
    "address": "493 Daisydell Court",
    "price": "1,038,000",
    "fullAddress": "493 Daisydell Court, San Jose, CA 95129",
    "numBeds": "3",
    "numBaths": "2",
    "sqft": "1230",
    "propertyImage": "/493-daisydell-court.jpg",
    "description": "Charming West San Jose Townhouse in Top Cupertino School District. Discover this delightful two-story townhouse in the sought-after Cupertino School District with a San Jose address! This home features three bedrooms and an open layout perfect for comfortable living and entertaining. Step outside to your private patio, surrounded by beautiful palm trees, for peaceful outdoor time. Nestled in Strawberry Square, a PUD community, this home offers a clubhouse, two private tennis courts, a swimming pool, and five playgrounds. Living in a PUD community provides more freedom than a typical condo. The HOA covers the water bill, exterior maintenance, roof, and landscaping. Prime Location: Close to major tech companies, I-280, Strawberry Park, Mitsuwa Marketplace, Westgate Mall, Santana Row, and Valley Fair Adjacent to John Mise Park, a 12-acre park with courts, a softball field, and picnic spots In addition to top Cupertino public schools, walking distance to Challenger, Archbishop Mitty, and Harker private schools"
  },
  {
    "key": "5501-de-marcus-boulevard-unit-519",
    "address": "5501 De Marcus Boulevard, Unit 519",
    "price": "799,000",
    "fullAddress": "5501 De Marcus Boulevard, Unit 519, Dublin, CA 94568",
    "numBeds": "2",
    "numBaths": "2",
    "sqft": "1269",
    "propertyImage": "/5501-de-marcus-boulevard.jpg",
    "description": "Charming Condo Conveniently Located in Dublin at Border of Pleasanton; Built in 2007; 2 Bed, 2 Bath; 1,269+/-SF; Situated on 5th Floor with High Ceiling & Panoramic View of Hills; Single-Level Corner Unit; Bright, Light & Airy; Modern Touches Throughout; Laminate Flooring in Living Room & Bedrooms; Open Living Dining Area with Tall Windows, Ceiling Fan & Glass Door Access to Balcony Shared with 2nd Bedroom; Gorgeous Open Kitchen with Trendy Cabinets, Granite Countertops, Breakfast Bar, Gas Range, Over-the-Range Microwave, Stainless Steel Appliances & Tile Floor; Primary Suite with Walk-in Closet, Ceiling Fan, Bathroom with Dual Sink, Corian Countertop & Oversized Stall Shower; 2nd Bedroom with Mirrored Closet Doors; Central A/C; Full Size Laundry Room; Secured Building with Security Gate Parking; Two Underground Side-by-Side Parking Spaces; Delightful Complex with Many Enjoyable Amenities Like Courtyard Gardens, Gym, Game Room & Community Room; HOA Fee covering Water, Garbage & Gas; Convenient Location Near Supermarket, Shopping, Restaurants, Parks, Trail & San Francisco Premium Outlets at Livermore; Blocks Away from Dublin/Pleasanton BART Station; Easy Access to Highway 580/680 & Close to Jobs"
  }
]
